# BuiltInFailures.ElementFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElementFailures Class
BuiltInFailures Class Members See Also
---
Failures about Elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ElementFailures
```

Visual Basic
---
```text
Public NotInheritable Class ElementFailures
```

Visual C++
---
```text
public ref class ElementFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ElementFailures
# See Also
BuiltInFailures..::..ElementFailures Members
Autodesk.Revit.DB Namespace